Repository: AA-Turner/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/sphinx.po
Languages: pt_br

source: Overview
pt_br: Visão Geral

source: Welcome
pt_br: Bem-vindos

source: What users say:
pt_br: O que usuários dizem:

source: &#8220;Cheers for a great tool that actually makes programmers <b>want</b> to write documentation!&#8220;
pt_br: &#8220; Graças a essa grande ferramenta faz programadores <b>adorarem</b> escrever documentação!#8220;

source: Sphinx is a tool that makes it easy to create intelligent and beautiful documentation, written by Georg Brandl and licensed under the BSD license.
pt_br: Sphinx é uma ferramenta que torna fácil criar documentação inteligente e bonita, escrito por Georg Brandl e licenciado sob licença BSD.

source: It was originally created for <a href="https://docs.python.org/">the Python documentation</a>, and it has excellent facilities for the documentation of software projects in a range of languages. Of course, this site is also created from reStructuredText sources using Sphinx! The following features should be highlighted:
pt_br: Originalmente criado para <a href="https://docs.python.org/">Python Documentação</a>, e com excepcionais funcionalidades para documentar projetos de software em uma gama de linguagens. Claro que esse site também foi criado com fontes reStructuredText usando Sphinx! As seguintes funcionalidades são enfatizadas:

source: <b>Output formats:</b> HTML (including Windows HTML Help), LaTeX (for printable PDF versions), ePub, Texinfo, manual pages, plain text
pt_br: <b>Formatos de Saída:</b> HTML (incluindo Ajuda Windows HTML Help), LaTeX (para versões PDF), ePub, Texinfo, Páginas man, Texto Plano

source: <b>Extensive cross-references:</b> semantic markup and automatic links for functions, classes, citations, glossary terms and similar pieces of information
pt_br: <b>Extensiva referência cruzada:</b> marcação semântica automatizada, funções com links, classes, citações, termos, glossários e pedaços similares de informação

source: <b>Hierarchical structure:</b> easy definition of a document tree, with automatic links to siblings, parents and children
pt_br: <b>Estrutura Hierárquica:</b> fácil definição de documento raiz, com ligações automáticas, acima e abaixo na estrutura

source: <b>Automatic indices:</b> general index as well as a language-specific module indices
pt_br: <b>Índices Automáticos:</b> índices gerais bem como especificidades de linguagem, índices módulos

source: <b>Code handling:</b> automatic highlighting using the <a href="http://pygments.org">Pygments</a> highlighter
pt_br: <b>Tratamento de Código Fonte:</b> automação ênfase usando <a href="http://pygments.org">Pygments</a> destaque

source: <b>Extensions:</b> automatic testing of code snippets, inclusion of docstrings from Python modules (API docs), and <a href="%(path)s#builtin-sphinx-extensions">more</a>
pt_br: <b>Extensões:</b> teste automático de código snippets, inclusão de docstrings de módulos Python (API docs), e <a href="%(path)s#builtin-sphinx-extensions">mais</a>

source: <b>Contributed extensions:</b> more than 50 extensions <a href="%(path)s#extensions">contributed by users</a> in a second repository; most of them installable from PyPI
pt_br: <b>Extensões de Contribuintes:</b> mais de 50 extensões <a href="%(path)s#extensions">contribuições dos usuários</a> no repositório secundário; muitos delaas instaláveis através de PyPI

source: Sphinx uses <a href="http://docutils.sourceforge.net/rst.html">reStructuredText</a> as its markup language, and many of its strengths come from the power and straightforwardness of reStructuredText and its parsing and translating suite, the <a href="http://docutils.sourceforge.net/">Docutils</a>.
pt_br: Sphinx usa <a href="http://docutils.sourceforge.net/rst.html">Projeto reStructuredText</a> como linguagem marcada e muito dos seus pontos fortes, vem do poder e capacidade sem igual do reStructuredText em receber, passar e traduzir <a href="http://docutils.sourceforge.net/">Projeto Docutils</a>.

source: Documentation
pt_br: Documentação

source: First steps with Sphinx
pt_br: Primeiros passos com Sphinx

source: overview of basic tasks
pt_br: visão das tarefas básicas

source: Search page
pt_br: Página Busca

source: search the documentation
pt_br: pesquisar documentação

source: Contents
pt_br: Conteúdos

source: for a complete overview
pt_br: para visão completa

source: General Index
pt_br: Índice Geral

source: all functions, classes, terms
pt_br: todas funções, classes, termos

source: Changes
pt_br: Atualizações

source: release history
pt_br: histório liberação

source: You can also download PDF/EPUB versions of the Sphinx documentation from pop up menu on lower right corner.
pt_br: Você também pode baixar as versões em PDF/EPUB do menu pop-up de documentação do ``Sphinx`` no canto inferior direito.

source: Examples
pt_br: Exemplos

source: Links to documentation generated with Sphinx can be found on the <a href="%(path)s">Projects using Sphinx</a> page.
pt_br: Links para documentação gerada com Sphinx podem ser encontrados na página <a href="%(path)s">Projetos usando Sphinx</a>.

source: For examples of how Sphinx source files look, use the &#8220;Show source&#8221; links on all pages of the documentation apart from this welcome page.
pt_br: Para exemplos de como arquivos fonte Sphinx se parecem, use os links &#8220;Exibir Fonte&#8221; em todas páginas a partir dessa página de boas vindas.

source: You may also be interested in the very nice <a href="http://matplotlib.sourceforge.net/sampledoc/">tutorial</a> on how to create a customized documentation using Sphinx written by the matplotlib developers.
pt_br: Também pode haver interesse nesse ótimo <a href="http://matplotlib.sourceforge.net/sampledoc/">tutorial</a> em como criar e personalizar documentação usando Sphinx, escrito pelos desenvolvedores do matplotlib.

source: There is a <a href="http://docs.sphinx-users.jp/">Japanese translation</a> of this documentation, thanks to the Japanese Sphinx user group.
pt_br: Também há, no link <a href="http://docs.sphinx-users.jp/">Idioma Japonês</a> esse documentação, graças ao grupo Usuários Sphinx em Japonês.

source: A Japanese book about Sphinx has been published by O'Reilly: <a href="https://www.oreilly.co.jp/books/9784873116488/">Sphinxをはじめよう / Learning Sphinx</a>.
pt_br: Um livro em japonês sobre o ``Sphinx`` foi publicado pela O'Reilly: <a href="https://www.oreilly.co.jp/books/9784873116488/">Sphinxをはじめよう / Learning Sphinx</a>.

source: Hosting
pt_br: Hospedagem

source: Need a place to host your Sphinx docs? <a href="https://readthedocs.org/">readthedocs.org</a> hosts a lot of Sphinx docs already, and integrates well with projects' source control. It also features a powerful built-in search that exceeds the possibilities of Sphinx' JavaScript-based offline search.
pt_br: Necessita de um local para armazenar seus documentos Sphinx? <a href="https://readthedocs.org/">readthedocs.org</a> já armazena diversos documentos Sphinx e integra-se bem com controle de fontes. Também tem funcionalidades nativas de busca que são mais abrangentes que mecanismo offline Sphinx JavaScript.

source: Contributor Guide
pt_br: Guia para Contribuir

source: If you want to contribute to the project, this part of the documentation is for you.
pt_br: Se desejar contribuir com o projeto, essa parte da documentação é para você.

source: <a href="%(path)s">Sphinx Developer’s Guide</a></li>
pt_br: <a href="%(path)s">Guia Desenvolvedor Sphinx </a></li>

source: <a href="%(path)s">Sphinx Authors</a></li>
pt_br: <a href="%(path)s">Autores Sphinx</a></li>

source: project
pt_br: projeto

source: Current version: <a href="https://pypi.org/project/Sphinx/" alt="PyPI"><img src="https://img.shields.io/pypi/v/sphinx.svg"></a>
pt_br: Versão Corrente: <a href="https://pypi.org/project/Sphinx/" alt="PyPI"><img src="https://img.shields.io/pypi/v/sphinx.svg"></a>

source: Install Sphinx with:
pt_br: Instalar Sphinx com:

source: Questions? Suggestions?
pt_br: Dúvidas? Sugestões?

source: Join the <a href="https://groups.google.com/group/sphinx-users">sphinx-users</a> mailing list on Google Groups:
pt_br: Junte-se à lista de discussão <a href="https://groups.google.com/group/sphinx-users">sphinx-users</a> mailing list on Google Groups:

source: or come to the <tt>#sphinx-doc</tt> channel on FreeNode.
pt_br: ou entrar no canal <tt>#sphinx-doc</tt> do FreeNode.

source: You can also open an issue at the <a href="https://github.com/sphinx-doc/sphinx/issues">tracker</a>.
pt_br: Também pode abrir um requerimento no <a href="https://github.com/sphinx-doc/sphinx/issues">tracker</a>.
